main_keyboard = {
            'one_time': False,
            'buttons': [
                [
                    {
                        'action': {
                            'type': 'text',
                            'label': 'Что задано'
                        },
                        'color': 'secondary'
                    },
                    {
                        'action': {
                            'type': 'text',
                            'label': 'Что на завтра'
                        },
                        'color': 'primary'
                    }
                ],
                [
                    {
                        'action': {
                            'type': 'text',
                            'label': 'Расписание'
                        },
                        'color': 'primary'
                    },
                    {
                        'action': {
                            'type': 'text',
                            'label': 'Расписание на завтра'
                        },
                        'color': 'secondary'
                    }
                ],
                [
                    {
                        'action': {
                            'type': 'text',
                            'label': 'Звонки'
                        },
                        'color': 'secondary'
                    }
                ],
                [
                    {
                        'action': {
                            'type': 'text',
                            'label': 'Команды'
                        },
                        'color': 'secondary'
                    }
                ]
            ]
        }

time_table = 'Будние дни:\n' \
             '1 урок 9:00 - 9:45\n' \
             '2 урок 9:55 - 10:40\n' \
             '3 урок 10:55 - 11:40\n' \
             '4 урок 12:00 - 12:45\n' \
             '5 урок 13:00 - 13:45\n' \
             '6 урок 13:55 - 14:40\n' \
             '7 урок 14:45 - 15:30\n' \
             '\n' \
             'Суббота:\n' \
             '1 урок 9:00 - 9:40\n' \
             '2 урок 9:50 - 10:30\n' \
             '3 урок 10:45 - 11:25\n' \
             '4 урок 11:45 - 12:25\n' \
             '5 урок 12:40 - 13:20\n'
schedule = {
    'пн':
        '1.Литература\n'
        '2.Физика\n'
        '3.Физ-ра\n'
        '4.Русский\n'
        '5.Астрономия\n'
        '6.Информатика(2)\n',
    'вт':
        '1.Информ(1)/Англ.яз(2)\n'
        '2.Информ(1)/Англ.яз(2)\n'
        '3.Англ.яз(1)/Информ(2)\n'
        '4.Англ.яз(1)/Информ(2)\n'
        '5.ОБЖ\n'
        '6.Биология\n'
        '7.Информатика(1)\n',
    'ср':
        '1.Электив инф/ист/общ-во\n'
        '2.История\n'
        '3.Алгебра\n'
        '4.Химия\n'
        '5.Геометрия\n'
        '6.Информ(1)/Англ.яз(2)\n'
        '7.Англ.яз(1)/Информ(2)\n',
    'чт':
        '1.Русский\n'
        '2.Литература\n'
        '3.Электив Математика/Рус.яз\n'
        '4.Алгебра\n'
        '5.Литература\n'
        '6.Физ-ра\n'
        '7.Физ-ра\n',
    'пт':
        '1.Алгебра\n'
        '2.Алгебра\n'
        '3.Геометрия\n'
        '4.Обществознание\n'
        '5.Обществознание\n'
        '6.Электив обществознание\n'
        '7.Электив английский\n',
    'сб':
        '0.Электив история\n'
        '1.История\n'
        '2.Биология\n'
        '3.Физика\n'
        '4.История\n'
        '5.География\n'
    }
funny_replies = ('Ты што меня за дурака держишь.........',
                 'Таково дня недели нет...',
                 'Ты меня не тролль',
                 'Ты думал я не замечу....',
                 'Ну вобщето.... Такого дня недели нет...',
                 'https://jdevelop.info/articles/programs-tutorials/259-sokrashcheniya-dlya-mesyatsev-i-dnej-nedeli\n'
                 'На почитай...')
funny_replies_photo = ('photo-189807376_457239190',
                       'photo-189807376_457239191',
                       'photo-189807376_457239192',
                       'photo-189807376_457239193',
                       'photo-189807376_457239142')

help_message = 'Держи список команд:\nhttps://vk.com/@news11a156-komandy-bota'

days_of_week = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб']

ask_time_table_pattern = r'(бот(,\s*)? )?(скажи |(с)?кинь )?(звонки|расписание звонков)'
ask_schedule_pattern = r'(бот(,\s*)? )?(скажи |(с)?кинь )?расписание( на \w+)?'
ask_hw_pattern = r'(ч|ш)т?(о|е|ё) (задано|(по|там с) дз)?(\s?на \w*)?\??'
set_hw_pattern = r'^\w{2}\s+(.+)\s+-\s+(.+)$'
ban_user_pattern = r'^(бан|ban)\s\[id(\d+)\|\S+\] - (.+)$'
unban_user_pattern = r'^(разбан|unban)\s\[id(\d+)\|\S+\]$'
ask_user_pattern = r'^кто написал дз( на (\S{2})( по (\S*)))?$'
broadcast_pattern = r'разошли\s?([\S\s]*)'